# GetSystemsAnalysisWorkflows Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..GetSystemsAnalysisWorkflows Method
Application Class See Also
---
Returns name and path information identifying systems analysis workflow files.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public IDictionary<string, string> GetSystemsAnalysisWorkflows()
```

Visual Basic
---
```text
Public Function GetSystemsAnalysisWorkflows As IDictionary(Of String, String)
```

Visual C++
---
```text
public:
IDictionary<String^, String^>^ GetSystemsAnalysisWorkflows()
```

# ### Return Value
The map of systems analysis workflows.
# Remarks
The map that is returned contains a key that is the name of the systems analysis workflow, and the value is the path to the workflow file.
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace